#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "1be2ceca41c24b1d31bc89b0ca9dac3e" -> "790e27abe7a2ce2eb0f5b223bd095cb1"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "16dfc042ec782f0a4d72e82cbce58cc4" -> "f6164bafaeea87d73e3c0c08dfe3acc0"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "b7ea9969ef58cd53a7835364208bc0c3" -> "6d0bad426c7e06fba04835c891f93c02"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "8b77a1f7ad6d7c4cb05c2e4e27836f40" -> "621b92c211355b79afba89efb5993fa2"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "d76f9645b23236689e01c6c9c572990f" -> "7de3fdf2d54d8951429ac954d507fa18"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "40fce44b33d2c097b6032055432403ec" -> "5e72cd976bcef69e1f674d42c2aeb58a"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "71191a0425eecc6bef1db49db322db55" -> "e1244d5a2f5e7955ef1d77be2942ad66"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "3bb2da7aaf36e5729c4650baf175ef3b" -> "20f4d31947d7f32f44c6192e82bfe21b"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "65ac27e75ac4e7261107a069b038abb0" -> "47f6dc90076452ab7bb0cc80f51436a9"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "918ce52f115e0fa20ce83d3836207c09" -> "8fce65ac80cca03f2f877e6761fe77a3"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "662c357a85af01a4379cf4811cb2e3c2" -> "3fc5ccd0ea8e0b71ae72119470e6e8d8"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "523b770bf07e08503e81c3f6087f2d13" -> "72a65db3203d47777912d213281d327c"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "68f88a9745e8ccb30b01b0862f56f9c8" -> "6f636e98402ebb764c88f81e602ba921"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "0b059ca8536ea2b111978a90b4b2b174" -> "5c8193cdecd81dd245ca015e8d109e57"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "1f4320e070a8a3552f7839143541eea6" -> "19ac4054b2cbe9f81c90bef928a5f2da"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "4f09a0cd7e8c7f060e49f35daea9a1c7" -> "fa8757aa6dcec9be88be4050a615b383"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "f0e54b9bca3aae4576b7748be4118fba" -> "b2f53b539c3fe8a9e0fbbb01f6b45be7"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "cd5ef6e0a70212640df3816710309106" -> "ae54388a33c20a33743e9b05f9fd2209"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "e8c02a3806e3a7a38bc5c1b9245824fe" -> "ba90487aa75a06ce74d94c2f469bec95"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "6f6404e590ca7329c291bbd7ca9c2e2e" -> "b13869a3c6068e6efa203e8c72a802dc"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "aefe28017c94058c5306e7846eb5b85b" -> "5ea1a8fe5c22d9411b5ea9ff850e6f28"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "183bd6c28c286b1a75581b42aff2efea" -> "6762c0e8d3055311e9eeb3de1ae2ade8"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "3475c3b0460254e891944e4bd5d55d2d" -> "60a63cd8e045a1ac557ef785a4e54891"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "a50652519174bd99ef07ce317e3e7aa8" -> "0ac028a63b426a20664325ea9ac1a598"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "b7905316d2adcd45c87b61c9fcdc2308" -> "b4492048e63c710d7ae8ce2f6daa94b9"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "9c75d1b2e3cc5dd7e76eb81ee20921a0" -> "1704df9f582d81fbffb8b8b4ced4647e"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7f66e3ef6f41617d8712a3ddc21cada7" -> "1691124504ec0c445d23a7e6f45b05f6"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "5b4f81992f27b3a31960aa618a2f3ecc" -> "2c603168c6a2f47d912f067696cda2ad"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "2bc42e1871125963d734eac22fed0225" -> "799c5d601524031aac31ea9afd372c59"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "4ad227eb3e74a85574d3b54699ac421c" -> "46c6cb8fe44fb08740b1c848dec1b32b"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "fc00a560b243e84c99e609eacdc40677" -> "b9a5dc10b33bdb2bf9a0a887ec22d72f"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "42ca2fb692552bf2775aef3e54f1236c" -> "dacb142378e427cc9cd49827c8440b65"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "c26f8703675c3928dd1ec38c411e852a" -> "fae859d7dea92628c21ed246a113707e"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "f0cf3cb7f2ef475fcb6f24a7ead92574" -> "c2367e28d4150b528bb3d94888c8b0c4"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "1c5f3a44581789f39a86322b471f4bf5" -> "74ddeb065abecbb8fcde04c60e502aa7"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "02cd987236dcb82ad3132368a7ad922a" -> "94777432e715bd28b5c6ef0f32978900"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "b0250ce808ed4e3417c67728e91a6135" -> "c25954fb5768f67b653472a1acdc91fb"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "9cf4711f41c324d42b88b55538569865" -> "534210f05ee9ab8c6c4d5c27a3283621"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "baf5556041fa35d121ff5d23df01a9e8" -> "10c3f84d0070fc6faf240041f12a68be"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "80deeff267036c7db43c2231f7ed0655" -> "bbce82cadabebe8b1bb551ed55a91710"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "3227dc25a31564a1bf949811d978f518" -> "6c0475a6bbb510262b994c53ff08d3b7"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "dbc043a7e7081aefb875a88dee8b9ea5" -> "963d67dff4052e976ab4652c43c21754"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "L0l9w/LUOnAPWeRWWpFGqYRSCM4x4ZbSFG2+sSGWfGE=" -> "/EUp12JBd6aSDtQzDD8WnUJhh23bfEdXj2iwIcHWUS8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "ouO1/siMWws+Tg/UVNTFy5pvkoNcBC1e47GJFAKpS/U=" -> "jVA8Vj2q6o8sMiZe4BNiPJQ87YNm5QtMaROj7SEMqoY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.815+0000" -> (known after apply)
      ~ source_code_hash               = "9b3Aoay3AHTLFekjpOIQlYNPuHlqUUPMUjLrekgqUOM=" -> "477Kl0HJVqGb714264VPLueskQmMndPBMoYp8XvjOeo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "zJnuuxEd53dB+c02lrQzKbxxVV91bzbEh6SxTO3K6RM=" -> "yUtaqyyfvgrDGt8XBuWiqsy5qU1xmT17Av1oYV8zr0o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "m5PqWZaAB/3Ipw8SJLO6ROAPky+twfdXXVXEXmgRrNk=" -> "TxRJMeQw+Lac0F9NTzFqkuWjqkZPBTu46hbia36Izrc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "AXxEalKVwy/Lq2S3TEElM+Z8UE+3kIU9nEr8Hvb2fqU=" -> "MYGD0myEYMe51JJn1G4j1l2+APfqpXK4Uus4bdtZ+os="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "ueXTXYAcQZNfvoEm/kFTjCmdc8AoEEZszXhn7xlmWCM=" -> "kyNzpgU0cmianSF3E+t/0aynodlXFdO5VBKMklX45ic="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "EDu+4Xbfd16SVRTcGbd3erYMQbgN/mgikTP7H1OZz3w=" -> "hQDSuuoz9SHQAT3bACA1uHe0ihYIDJ2UhB8gUjCrHm4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "NRGIpMvuI2g/jHxC02dHKIpAQsOVa+ED8pTGerDI+o0=" -> "KXJGqRdJL21vy6lKuKv6dcgAfiMcFvKTpxPB9vjJ5M4="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZT17nljKBhsGiExXynfaZcOlwC+bBnd+/SVUqwY1v94=" -> "Oyw8lywdKa6sHBT+Go/LnocejftYW6kqohj8IVvHg3E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Iqq3YckCBN0WTAtINnlMSzmGtFvJjwvBG1BWzY5MePE=" -> "3DsWuIrJVPpLxd5C/AyLUBjhIHx9zhxg9lcA3jvAhIQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.048+0000" -> (known after apply)
      ~ source_code_hash               = "s7zR0z9POPE/e6j63GBOZ1JNa/w4xZ/nQ8RGuHQ4LPs=" -> "R+iZ53lPBekZ70Ccv0SI/IdvPYDTibJKcmpIBZOjHmw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bhqb6ui6BcwO5wPIuNKjsOdGg4tTVY0v0j2ksFDDK5E=" -> "lybmPTyX4BllLcoQfMBm7k4EwVtI+vwy9EaEgkrt4Fk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "kbJTwmQpfn9OQ7v7xf6yMWPJtogJJ8huk6uLy1p0k6g=" -> "m8wCwKPmK/cIR6KcxF8AgYXNTOZw5XWUZxobGejylsw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "bBz9iKqFXZ5oGZfuctRZP+/DVQWYeaFjrgFSBsqVftU=" -> "ocayi09mV3FBUHtccZcxhsS8ZuuaszNA3Zgah/yCkgA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "yfG18UnEa8Si3yD0RVGEUQmCVjAFg7JL5oayJrdszVE=" -> "dtHcuIIYb/kKDO+oGkzLG/CpZ3iap/+jLycvYFgCZCA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q+ATtGUM4Ycsp7xBbqMlRHnTarlV29hPLUWQx6wdywQ=" -> "cTOTx9Z51JTpzDuL9f2HnA+EXqb7tGQmNeewCwT6Mpc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "NEWix2wfCHWigp/rGPp6MzQ2xDQUBbT78NQr8KfEtOw=" -> "oyV+YAbdNVCRKZ1/LvLtFhVJnvPnUl3G6jMHZQDavT0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "AS++zzwQBkvk5Yj6qiEVa41By26MKRNb3+zkjzy4kw0=" -> "ZHTNqHP+R86Eyo1+PFXww90vv1TeOQjLWrcTkCncAgw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "m6HPI0pYQ3CGOsvKL23013faUx0I7EcAYVjWvuY4IxM=" -> "OVIDpHOyRCRhNqgwPlRhHfBF4+p1DbQCEnmEdMilsAo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "RRwQXcrQNgZ3Jv3Ylaa7OOoimSEplV+p1oSzjNNryH8=" -> "pAafMJI9vfh+gYffOW98CwPfJJBLwQfdg7Qh5Xs3jt8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "2ROWm3jLGrAeB4xiiwfnewdjPxgghOyYL9AwaaNCpq8=" -> "/eQnRq1RukHLa1SR2anA2YSnN7IPTvshRc2RDJkpGfY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "wKepvwT6jx+NoQaT7az9pkS66R62lPlK1ls7KFoQ86s=" -> "gSqGaVR3iDQKkNbdHWBuyP7XTRnw9BYyS5GUATdvGR8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "iXwcJx1xH58F2KKBFhrWAfCa36T/zQaUanSbHXtLtbc=" -> "BK5qvCj2QmJ21iHbMB2lCougPWXBGbz6+RG50KmlDDY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-21T13:35:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "rKQcG01bI6YvaBvJPxyl32MJ4pm1nAo7LqSe6PC0U0Q=" -> "+8NistG71jDLXrINN1IXyWz9R5RjXZM0tUiZVUK4lP4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "VOC80MSGwSZKu90RT5+fRGWKOmlWMvHlGapRkhH0kq8=" -> "qRpZkHi+af4XvxOkg5E/CCMBhrqfOk7K9Xm0+D4YOfg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "xfq8hNaBTvHxwpjno1kUX/dghIzLSU7OAVm/EYxU2H4=" -> "oIR+L+cxEOKWo3GOA1gtzr8Hlp16CHhWop7U9vUN9sE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "yDbtUTMXcav1JJqHsKNV7N2byCXIX9A/hs47cD7pqvU=" -> "Sx4eEeFZ+h6yspiqxOUIm9iwN6euyr2wIVMoLHiJPNs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "ct8Vvxdpr5Mm1v+3X0qCLmj0QJAQJwnH3H2JENv1S9g=" -> "irmGPuzT27eQY4fWJbauBD2ge6WT3EhNnU1+FZOBnQY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-19T15:40:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "n74A2nSqUnbScU2OG0plV3z2LBL51s7P40/6RnPKhQ4=" -> "64AzT04YG7A2LMLQvYMr0Z6qIQ/5+jgCQBObGeipHLw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "y9CAh/eiSIb/4eBz5rwF1eWLhB1ul1Eftv65+IsK7mA=" -> "87pD0H78lJPDqsYmYcDRwy5Z7DvF1vAnzF3e0JW501M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "nmgbEClnpQn/8CBpIlvglCfU/JCMtDxpRA9F+1tX3cs=" -> "HIZKiAGmwnTXzJcVbbfyAZd/yg18km/5hgRX6GGyoe8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "UnAykZq0oRSsaGuNp/DZAa1Juu48M77k1tvyjlStUF8=" -> "4vt89DoL9eDGq4bl8VV9SX6XrRewB9sS60vzSgqulaQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "TII9KzTL8kfjQR5CsuEKJmtjTi1AbB0NFdOdeE3E2ro=" -> "IebPm6T59NY0Kenx43V39hx42oO6UzTzQ9EIVsUyiak="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "6vBYkANzSSZEHvwiB8r/0NS6gzPuM86Ak82CDbYg9Fs=" -> "/xPUE+vyGQ3gxGsLrFJZacxFWfhVK7QjiVrcZpUYmIs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "OQBGmlhxzLK9d1hMB76DGXN8MYWFCwVqed1M1INrKvQ=" -> "vrlD8TLCfzZrsZjTXI25vPLhUE5UfvZo/tA+m+nWMrE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "kBP0/pruva19T7CVoJttksFOnGdD9EKDj8M1owir46U=" -> "6YZMYXTHryeBbtUw79T9hPX9maTO0BOKwom40kIfDMA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.815+0000" -> (known after apply)
      ~ source_code_hash               = "qTTqw2sRQ53+Jn9C5+RTpJYm4xyDn8j364P3yzX3Wt0=" -> "0rw10fkQ1G4e61HC4UtZv0HrzbPCnuOJPAloQviT3A8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "2AvEjneqTOWEZjdhnp8s8y4Gn7WgFRCVzKTHPspueug=" -> "ATPGv4OlMY0YeZlpgtTmTpGVEBxs/pVPFWnrwZCbjcU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "40zNJzZ19czzxc2OcYcLce7+ardm5BsZBRW36VuBKPY=" -> "V3BpE+aZ7/bC3ITrJYSkypJoxFAIzgR27vcc2p/NlA8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "PWLIdkSRaYfWnrxkwDyZYeIlYMw5A04KnfQgaFKS0HE=" -> "l1p2IMpDylJbyzosqaXQ8lnFwXkE0cbBhIOOPdh4L1o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-17T19:16:40Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "pgdiga" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-17T19:16:39Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-17T19:16:39Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 85 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*